'''
##对象由三部分组成：
  1.对象的标识（id）
  2.对象的类型（type）
  3.对象的值（value）

##面向对象（opp）
python是一门面向对象的编程语言
所谓的面对对象的语言，简单理解就是语言中的所有操作都是通过对象来进行的
'''
#（面向过程的编程语言：
#  面向过程指将我们的程序的逻辑分解为一个一个的步骤
#  通过对每个步骤的抽象，来完成程序）
#    面向过程的编程思想将一个功能分解为一个一个小的步骤
#      我么通过完成一个一个的小的步骤来完成一个程序
#    这种编程方式，符合我们人类的思维，编写起来相对比较简单
#    但是这种方式编写代码往往只适用于一个功能
#     如果要实现别的功能，即使功能相差极小，也往往要重新编写代码，可复用性比较低，并且难以维护

'''面向对象的编程语言
    面向对象的编程原因呢，关注的是对象，而不是过程
    对于面向对象的语言来说，一切都是对象
    
    面对对象的编程思想，将所有的功能同意保存到对应的对象中
    要使某个功能，直接找到对应的对象即可
    面向对象这种方式编写的代码，比较容易阅读，比较易于维护，容易复用
    但是这种方式编写，不太符合常规思维

归纳：面向对象的思想
1.找对象
2.搞对象
'''
